In [1]:
import pandas as pd 
import numpy as np

In [2]:
r= np.arange(0, 2, 0.2)

In [3]:
ser= pd.Series(r)

In [4]:
ser.sum()

9.000000000000002

In [5]:
ser.min()

0.0

In [6]:
ser.describe()

count    10.00000
mean      0.90000
std       0.60553
min       0.00000
25%       0.45000
50%       0.90000
75%       1.35000
max       1.80000
dtype: float64

In [8]:
df1 = pd.DataFrame({'A': ser[:4]+1, 'B': ser[4:]+2}).fillna({'A':1, 'B':2})

In [9]:
df1

     A    B
0  1.0  2.0
1  1.2  2.0
2  1.4  2.0
3  1.6  2.0
4  1.0  2.8
5  1.0  3.0
6  1.0  3.2
7  1.0  3.4
8  1.0  3.6
9  1.0  3.8

In [10]:
df1.mean()

A    1.12
B    2.78
dtype: float64

In [11]:
df1.mean(axis='columns')

0    1.5
1    1.6
2    1.7
3    1.8
4    1.9
5    2.0
6    2.1
7    2.2
8    2.3
9    2.4
dtype: float64

In [12]:
df1.describe()

               A          B
count  10.000000  10.000000
mean    1.120000   2.780000
std     0.214994   0.726942
min     1.000000   2.000000
25%     1.000000   2.000000
50%     1.000000   2.900000
75%     1.150000   3.350000
max     1.600000   3.800000

In [13]:
df2 = pd.DataFrame({'étudiant': ['A', 'B', 'C', 'A', 'B', 'C'],'notes': np.random.randint(12,18,6)}, columns=['étudiant','notes'])

In [14]:
df2

  étudiant  notes
0        A     16
1        B     16
2        C     16
3        A     16
4        B     14
5        C     13

In [15]:
df2

  étudiant  notes
0        A     16
1        B     16
2        C     16
3        A     16
4        B     14
5        C     13

In [16]:
df2.groupby('étudiant').sum()

          notes
étudiant
A            32
B            30
C            29

In [17]:
df2.groupby('étudiant').describe()

         notes
         count  mean       std   min    25%   50%    75%   max
étudiant
A          2.0  16.0  0.000000  16.0  16.00  16.0  16.00  16.0
B          2.0  15.0  1.414214  14.0  14.50  15.0  15.50  16.0
C          2.0  14.5  2.121320  13.0  13.75  14.5  15.25  16.0

In [20]:
def fonction_filte(v): return v['notes'].median() > 14

In [21]:
df2.groupby('étudiant').filter(fonction_filte)

  étudiant  notes
0        A     16
1        B     16
2        C     16
3        A     16
4        B     14
5        C     13

In [22]:
moyennes= df2.groupby('étudiant').mean().add_prefix('moyenne_')

In [23]:
moyennes

          moyenne_notes
étudiant
A                  16.0
B                  15.0
C                  14.5